fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>ВКМ_Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_СписокДоговоров</name>
    <attributes>
      <name>ВКМ_Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДокументРеализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
&НаКлиенте
Процедура МесяцОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	 Пока СтрДлина(ВыбранноеЗначение) = 4 Цикл
        СформироватьСписокВыбораМесяца(?(ТипЗнч(ВыбранноеЗначение) = Тип("ЭлементСпискаЗначений"),ВыбранноеЗначение.Представление,ВыбранноеЗначение));
        ВыбранноеЗначение = ЭтаФорма.ВыбратьИзСписка(Элемент.СписокВыбора, Элемент);
    КонецЦикла;
    
    ВыбранноеЗначение = ?(ТипЗнч(ВыбранноеЗначение) = Тип("ЭлементСпискаЗначений"),ВыбранноеЗначение.Значение,ВыбранноеЗначение);
КонецПроцедуры   

Процедура СформироватьСписокВыбораМесяца(Знач Год)
    
    Год = Число(Год);
    СписокВыбора = Элементы.Месяц.СписокВыбора;
    СписокВыбора.Очистить();
    //Формирование СЗ
    СписокВыбора.Добавить(Формат(Год-1, "ЧГ=0"), Формат(Год-1, "ЧГ=0"));
    Для М = 1 По 12 Цикл
        СформДата = Дата(Год, М, 1);
        Наим = Формат(СформДата, "ДФ='ММММ гггг""г.""'");
        СписокВыбора.Добавить(СформДата, Наим);    
    КонецЦикла;
    СписокВыбора.Добавить(Формат(Год+1, "ЧГ=0"), Формат(Год+1, "ЧГ=0"));
    
КонецПроцедуры

&НаКлиенте
Процедура ВКМ_СоздатьАктыПоДоговорам(Команда)
	Если Не ЗначениеЗаполнено(Объект.ВКМ_Период) Тогда
		Сообщить("Не заполнен период.");
		ОбработкаПрерыванияПользователя();
		Возврат;
	Иначе 
		СтруктураФоновогоЗадания 	= ВКМ_ВыполнитьФоновоеЗаданиеНаСервере(УникальныйИдентификатор);
		ИДЗадания 	= СтруктураФоновогоЗадания.ИдентификаторЗадания;
		
		ПараметрыОжидания 	= ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		//ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
		ПараметрыОжидания.Интервал  = 2;
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(СтруктураФоновогоЗадания, 
		Новый ОписаниеОповещения("ВКМ_ОбработатьДанные", ЭтотОбъект), 
		ПараметрыОжидания);
	КонецЕсли;
КонецПроцедуры     

&НаСервере
Функция ВКМ_ВыполнитьФоновоеЗаданиеНаСервере(УникальныйИдентификатор)
	
	НаименованиеЗадания = "Запуск массового создания документов";
	ВыполняемыйМетод = "Обработки.ВКМ_МассовоеСозданиеАктов.ВКМ_МассовоеСозданиеАктовПоПериоду";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина; 
	
	ПараметрыЗАпуска = Новый Структура;
	ПараметрыЗАпуска.Вставить("Период",Объект.ВКМ_Период);
	ТабЧасть = Объект.ВКМ_СписокДоговоров.Выгрузить(,"ВКМ_Договор");
	ПараметрыЗАпуска.Вставить("ТабЧасть",ТабЧасть); 
	
	СтруктураФоновогоЗадания = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ВыполняемыйМетод, ПараметрыЗапуска.Период, ПараметрыЗапуска.ТабЧасть); 
	
	Возврат СтруктураФоновогоЗадания;
	
КонецФункции  

Процедура ВКМ_ОбработатьДанные(Результат, ДополнительныеПараметры) Экспорт

    Если Результат = Неопределено Тогда
      Возврат;
    КонецЕсли;
    ТЗРезультат = ПолучитьИЗВременногоХранилища(Результат.АдресРезультата);
	Для каждого стр Из Объект.ВКМ_СписокДоговоров Цикл      
		Для каждого стрТЗ из ТЗРезультат Цикл   
			если стр.ВКМ_Договор = стрТЗ.ВКМ_Договор Тогда 
				ЗаполнитьЗначенияСвойств(стр,стрТЗ);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СформироватьСписокВыбораМесяца(Год(ТекущаяДата()));
    Месяц = Элементы.Месяц.СписокВыбора[Месяц(ТекущаяДата())].Значение;
КонецПроцедуры
